"""1. Создайте функцию, которая принимает три параметра,
один из которых - строка, второй - символ, который надо заменить
на другой символ - третий параметр."""

"""2. Создайте функцию, которая принимает в виде параметра 
строку и определяет отдельно количество букв верхнего регистра 
и нижнего."""

"""3. Создайте функцию, которая принимает в виде параметра строку 
и заменяет все цифры на дефис ("-")."""

"""4. Создайте функцию, которая принимает в виде параметра число. 
Если число делится на 3, то прибавить к нему остаток при делении на 
7 и ещё 11, иначе отнять от него остаток при делении на 5 и ещё 2. 
Повторять операцию, пока число не станет делиться на 19 и вернуть 
полученное число."""


"""5. Создайте функцию, которая принимает в виде параметра строку 
и возвращает список из различных символов этой строки."""


"""6. Создайте функцию, которая принимает в виде параметра число 
и возвращает его факториал. Делать через цикл!"""


"""7. Создайте функцию, которая принимает в виде двух параметров 
два числа и возвращает первое число в степени второго числа. Делать 
через цикл!"""


"""8. Создайте функцию, которая принимает в виде двух параметров два 
числа и если клетка на шахматном поле с указанными координатами белая, 
то вернуть число 0, иначе вернуть число 1. Клетки с координатами 1 и 1, 
1 и 3, 3 и 1 и т. д. белые, а клетки с координатами 1 и 2, 1 и 4, 2 и 1 - 
нет."""


"""9. Создайте функцию, которая создаёт список из 50 чисел от 1 до 100, 
затем убирает оттуда все числа, которые делятся на 11, 13, 17 или 19 и 
возвращает полученный список."""


"""10. Создайте функцию, которая принимает четыре параметра, 
один из которых - натуральное число, второй - натуральное число, 
большее чем первое, третий - тоже натуральное число, а четвёртый - 
натуральное число, меньшее чем третье. Верните список из чисел от 
первого числа до второго, которые при делении на третье число дают 
остаток, равный четвёртому числу."""

"""11. Создайте функцию, которая принимает в виде параметров три 
числа, и в которой черепашка количество раз, равное третьему числу, 
двигается на количество пикселей, равное первому числу, и поворачивается 
на количество градусов, равное второму числу."""

"""12. Создайте функцию, которая рисует прямоугольник со случайными 
длинами сторон, случайными цветами контура и заливки, а также случайной 
толщиной контура."""
