print(3 + 8)
print(2 - 7)
print(4 * 9)  # умножение
print(10 / 2)  # обычное деление 10 / 3 = 3.33333
print(15 // 2)  # целочисленное деление 10 / 3 = 3
print(17 % 3)  # возврат остатка от деления 10 % 3 = 1
print(5 ** 2)  # возведение в степень
# print выводит то, что вы ей передадите
print(2 * 7 > 12)  # сравнение чисел
print(1234 < 0 * 100)  # сравнение чисел
print(18 >= 3)  # больше или равно
print(21 - 1 == 20)  # равенство ==
print(23 != 17 * 2)  # НЕ равно

# строчки пишутся в кавычках. Вид кавычек не важен
print('Hello, world! 472034 + 23')
# если написать внутри строки математическую операцию, работать она не будет
