'''
Правила названий переменных
1. Понятно. Вы должны называть переменные
понятными словами, чтобы вам было проще
понимать, что в них находится.
2. ТОЛЬКО АНГЛИЙСКИЙ ЯЗЫК
3. НЕЛЬЗЯ использовать специальные символы
!,:.?-+(){}[]@#$%^&*,
НО можно использовать _
4. Если нужно назвать переменную несколькими словами,
пишите:
  а) Каждое слово с большой буквы - MyFavoriteFood
  б) Слова разделяйте _ - my_birthday
'''

# чтобы создать переменную, надо написать ее имя и присвоить значение
my_cat = 'Лиза'
print('Мою кошку зовут', my_cat)

# чтобы ввести что-то в программу (сохранить в переменной),
# нужно использовать функцию input()
name = input('Как тебя зовут? ')
print('Привет,', name)


